src/cf/InformationRegisters/ТТС_ДанныеОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТТС_ДанныеОтчетов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТТС_Направления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВнутреннийДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТТС_ОтчетыПоЖурналамТУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрафаОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТТС_ГрафыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ТТС_ДанныеОтчетов/Ext/ManagerModule.bsl
Процедура ЗаписатьДанныеОтчетов(ДанныеОтчета) Экспорт
	НаборЗаписей = РегистрыСведений.ТТС_ДанныеОтчетов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВнутреннийДокумент.Установить(ДанныеОтчета.ВнутреннийДокумент);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ДанныеОтчета.ВнутреннийДокумент.ПометкаУдаления И ЗаписыватьДанныеОтчетов(ДанныеОтчета) Тогда
		
		ГрафыОтчетов = ТТС_ОтчетыЖТУСервер.ПолучитьГрафыОтчетовПоКодуНарушения(ДанныеОтчета.КодНарушения, ДанныеОтчета.ЯвляетсяНарушением);
		Для Каждого ОтчетИГрафы ИЗ ГрафыОтчетов Цикл
			Для Каждого Графа ИЗ ОтчетИГрафы.Значение Цикл
				Запись = НаборЗаписей.Добавить();
				Запись.Период = ДанныеОтчета.ДатаПоездки;
				Запись.Отчет = ОтчетИГрафы.Ключ;
				Запись.ВнутреннийДокумент = ДанныеОтчета.ВнутреннийДокумент;
				Запись.Направление = ДанныеОтчета.Направление;
				Запись.ГрафаОтчета = Графа;
			КонецЦикла;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаписыватьДанныеОтчетов(ДанныеОтчета)
	Если ЗначениеЗаполнено(ДанныеОтчета.КодНарушения) 
		И ЗначениеЗаполнено(ДанныеОтчета.Направление)
		И ЗначениеЗаполнено(ДанныеОтчета.ДатаПоездки) Тогда
		
		Возврат Истина;
	Иначе	
		Возврат Ложь;
	КонецЕсли;
КонецФункции
